////////////////////////////////////////////////////////////
///
/// 21.9.25 - 12시
/// 
/// ////
/// * 멀티씬 에디팅 가능하도록 제작하자. (21.09.25 19시 시작, 19시 20분 완료)
/// 
/// 
/// 
/// 
/// ////
/// * 난이도 설정이 가능하도록 상위 클래스를 만들어 프레젠테이션을 컨트롤 하고 싶다. (21.09.25 15시 45분 시작, 16시 30분 종료)
/// 난이도 컨트롤이 가능하도록 한다.
/// 난이도 컨트롤은 2가지이다. 1개는 가는 장소, 1개는 시간이다.
/// 
/// 
/// 
/// ////
/// * 씬 1의 UI 작업 진행해야 한다.(21.09.25_15시 시작, 완료 15시 45분)
/// UI가 재배치 되어도 코드상 문제가 없도록
/// 도중에 한번 멈출 수 있어야 한다. 
/// 
/// 
/// ////
/// * ChangethingInfoStr에 갔던 날짜, 몇번째 장소를 기록해야 한다.(21.09.25_12시 06분 시작, 완료)
/// // 제한사항.
/// // 며칠인지 presentation이 정할 수 없다. 이는 더 큰 클래스에 요청해서 확인해야 한다. 혹은, presentation이 이 기능을 수행하기로 정해야 한다.
/// 
/// 몇번째로 갔는지는 확실히 확인할 수 있다.
/// 
/// ////
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
/// 
////////////////////////////////////////////////////////////

